# IsFlipped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbolProfile..::..IsFlipped Property
FamilySymbolProfile Class See Also
---
Indicates if the symbol profile is flipped or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFlipped { get; set; }
```

Visual Basic
---
```text
Public Property IsFlipped As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsFlipped {
	bool get ();
	void set (bool value);
}
```

# See Also
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace